#+title: inf
#+date: 2024-12-31T00:23:13+01:00

*** Entfernen von Spalten
:PROPERTIES:
:CUSTOM_ID: entfernen-von-spalten
:END:
Das Entfernen von Spalten ist ebenso einfach. Die Methode =drop()= kann
verwendet werden, um Spalten zu entfernen. Sie benötigen den Namen der
Spalte und die Achseninformation (axis=1 für Spalten).

#+begin_src
# Spalte entfernen
df = df.drop('C', axis=1)

print(df)
#+end_src

#+begin_src
# DataFrame erstellen
df = pd.DataFrame({
   'A': [1, 2, 3],
   'B': [4, 5, 6],
   'C': [7, 8, 9]
})

# Spalte C entfernen
df = df.drop("C", axis = 1)

df
#+end_src

#+RESULTS:
:    A  B
: 0  1  4
: 1  2  5
: 2  3  6
#+begin_src
# Alternativ inplace Bearbeitung des DataFrames
df.drop("B", axis = 1, inplace = True)
df
#+end_src

#+RESULTS:
:    A
: 0  1
: 1  2
: 2  3


*** Modifizieren von Spalten
:PROPERTIES:
:CUSTOM_ID: modifizieren-von-spalten
:END:
Spalten können auch modifiziert werden, indem sie direkt überschrieben
oder durch eine Funktion verändert werden.

#+begin_src
# Spalte modifizieren
df['A'] = df['A'] * 2

print(df)
#+end_src

#+begin_src
# DataFrame erstellen
df = pd.DataFrame({
   'A': [1, 2, 3],
   'B': [4, 5, 6],
   'C': [7, 8, 9]
})

# Spalte modifizieren
df['A'] = df['A'] * 2

df
#+end_src

#+RESULTS:
:    A  B  C
: 0  2  4  7
: 1  4  5  8
: 2  6  6  9


*** Hinzufügen und Entfernen von Zeilen
:PROPERTIES:
:CUSTOM_ID: hinzufügen-und-entfernen-von-zeilen
:END:
Zeilen können mit der Methode =append()= hinzugefügt werden. Um Zeilen
zu entfernen, verwenden Sie die Methode =drop()= mit dem Index der Zeile
und der Achseninformation (axis=0 für Zeilen).

#+begin_src
# Zeile hinzufügen
new_row = pd.Series([10, 11], index=['A', 'B'])
df = df.append(new_row, ignore_index=True)

# Zeile entfernen
df = df.drop(2, axis=0)

print(df)
#+end_src

#+begin_src
# DataFrame erstellen
df = pd.DataFrame({
   'A': [1, 2, 3],
   'B': [4, 5, 6],
   'C': [7, 8, 9]
})

# Zeile entfernen
df = df.drop(2, axis=0)

df
#+end_src

#+RESULTS:
:    A  B  C
: 0  1  4  7
: 1  2  5  8


